Pandas

In [1]:
import pandas as pd

data={"Name":["Rohan", "Aman", "Ram", "Hari", "Raman", "Hari", "soman"],  
     "Age":[20,19,15,22,33,21,34],
     "Salary":[20000, 39000, 42000, 14000, 1000, 1000, 1000]}  #creat disctionary
df=pd.DataFrame(data)  #convert dictionary data into fram using DataFrame.
print(df)

    Name  Age  Salary
0  Rohan   20   20000
1   Aman   19   39000
2    Ram   15   42000
3   Hari   22   14000
4  Raman   33    1000
5   Hari   21    1000
6  soman   34    1000

In [2]:
df=pd.read_csv("E:/Git Demo/employee.csv") #load dataset
print(df)

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F      NaN    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali    NaN  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M      NaN    3%
6  EMP02     rohit      M  25000.0    2%

In [3]:
print(df.head(10)) #used to find first 10 data from dataset. (defult value is 5)
print(df.tail(10))#used to last 10 data from dataset. (defult value is 5)

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F      NaN    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali    NaN  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M      NaN    3%
6  EMP02     rohit      M  25000.0    2%
    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F      NaN    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali    NaN  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M      NaN    3%
6  EMP02     rohit      M  25000.0    2%

In [4]:
print(df.info()) #used to find datatype from the dataset.

<class 'pandas.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   EEID    7 non-null      str
 1   Name    6 non-null      str
 2   gender  6 non-null      str
 3   salary  5 non-null      float64
 4   Bonus   7 non-null      str
dtypes: float64(1), str(4)
memory usage: 412.0 bytes
None

In [5]:
print(df.describe()) #use to find or describe the numerical value from the dataset.

             salary
count      5.000000
mean   24400.000000
std     2607.680962
min    20000.000000
25%    25000.000000
50%    25000.000000
75%    25000.000000
max    27000.000000

In [6]:
print(df.isnull().sum()) #used to find the null value using "isnull". & using (.sum) for colum wise find null value.

EEID      0
Name      1
gender    1
salary    2
Bonus     0
dtype: int64

In [7]:
print(df.duplicated()) #used to find duplicated data

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [8]:
print(df["EEID"].duplicated()) #used to find specific colum.

0    False
1    False
2    False
3     True
4    False
5    False
6     True
Name: EEID, dtype: bool

In [9]:
print(df["EEID"].duplicated().sum()) #used to find sum of total duplicated value.

2

In [10]:
print(df.drop_duplicates("EEID")) # used to drop the duplicates value.

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F      NaN    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali    NaN  27000.0    2%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M      NaN    3%

Working with missing Data in pandas

In [11]:
print(df.dropna()) #drop null value.

    EEID    Name gender   salary Bonus
1  EMP02   rohit      M  25000.0  1.5%
3  EMP01  ayushi      F  20000.0    0%
6  EMP02   rohit      M  25000.0    2%

In [12]:
import numpy as np
print(df)

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F      NaN    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali    NaN  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M      NaN    3%
6  EMP02     rohit      M  25000.0    2%

In [13]:
df["salary"] = df["salary"].replace(np.nan, 30000) #Replace the missing value 
print(df)

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F  30000.0    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali    NaN  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M  30000.0    3%
6  EMP02     rohit      M  25000.0    2%

In [14]:
df["gender"] = df["gender"].replace(np.nan, "M")
print(df)

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F  30000.0    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali      M  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M  30000.0    3%
6  EMP02     rohit      M  25000.0    2%

In [15]:
print(df["salary"].mean()) #used to find mean

26000.0

In [16]:
print(df)

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F  30000.0    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali      M  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05       NaN      M  25000.0    0%
5  EMP06     rohit      M  30000.0    3%
6  EMP02     rohit      M  25000.0    2%

In [17]:
print(df.bfill(inplace = True)) #used to fill data from backward.

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F  30000.0    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali      M  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05     rohit      M  25000.0    0%
5  EMP06     rohit      M  30000.0    3%
6  EMP02     rohit      M  25000.0    2%

In [18]:
print(df)

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F  30000.0    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali      M  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05     rohit      M  25000.0    0%
5  EMP06     rohit      M  30000.0    3%
6  EMP02     rohit      M  25000.0    2%

In [19]:
print(df.ffill(inplace = True)) # used to fill data from front ward.

    EEID      Name gender   salary Bonus
0  EMP01    ayushi      F  30000.0    0%
1  EMP02     rohit      M  25000.0  1.5%
2  EMP03  pranjali      M  27000.0    2%
3  EMP01    ayushi      F  20000.0    0%
4  EMP05     rohit      M  25000.0    0%
5  EMP06     rohit      M  30000.0    3%
6  EMP02     rohit      M  25000.0    2%

Columns Transformation in pandas. Part-1

In [20]:
df.loc[(df["Bonus"] == "0%"),"getbonus"] = "nobonus" 
df.loc[(df["Bonus"] > "0%"), "getbonus"] = "Getbonus"
print(df) # use to find the specific contant for specific colum.

    EEID      Name gender   salary Bonus  getbonus
0  EMP01    ayushi      F  30000.0    0%   nobonus
1  EMP02     rohit      M  25000.0  1.5%  Getbonus
2  EMP03  pranjali      M  27000.0    2%  Getbonus
3  EMP01    ayushi      F  20000.0    0%   nobonus
4  EMP05     rohit      M  25000.0    0%   nobonus
5  EMP06     rohit      M  30000.0    3%  Getbonus
6  EMP02     rohit      M  25000.0    2%  Getbonus

In [21]:
df["Add Bonus"] = df["salary"].astype(str) +" "+ df["Bonus"].astype(str)
print(df)  #using .astype(str) to add int value if we have str value then
#           no need to use.
#use ".str.Capitalize()" to print first letter capital

    EEID      Name gender   salary Bonus  getbonus     Add Bonus
0  EMP01    ayushi      F  30000.0    0%   nobonus    30000.0 0%
1  EMP02     rohit      M  25000.0  1.5%  Getbonus  25000.0 1.5%
2  EMP03  pranjali      M  27000.0    2%  Getbonus    27000.0 2%
3  EMP01    ayushi      F  20000.0    0%   nobonus    20000.0 0%
4  EMP05     rohit      M  25000.0    0%   nobonus    25000.0 0%
5  EMP06     rohit      M  30000.0    3%  Getbonus    30000.0 3%
6  EMP02     rohit      M  25000.0    2%  Getbonus    25000.0 2%

Columns Transformation in pandas. Part-2

In [22]:
print(df)

    EEID      Name gender   salary Bonus  getbonus     Add Bonus
0  EMP01    ayushi      F  30000.0    0%   nobonus    30000.0 0%
1  EMP02     rohit      M  25000.0  1.5%  Getbonus  25000.0 1.5%
2  EMP03  pranjali      M  27000.0    2%  Getbonus    27000.0 2%
3  EMP01    ayushi      F  20000.0    0%   nobonus    20000.0 0%
4  EMP05     rohit      M  25000.0    0%   nobonus    25000.0 0%
5  EMP06     rohit      M  30000.0    3%  Getbonus    30000.0 3%
6  EMP02     rohit      M  25000.0    2%  Getbonus    25000.0 2%

In [23]:
df["commission"] = (df["salary"]/100)*20
print(df)

    EEID      Name gender   salary Bonus  getbonus     Add Bonus  commission
0  EMP01    ayushi      F  30000.0    0%   nobonus    30000.0 0%      6000.0
1  EMP02     rohit      M  25000.0  1.5%  Getbonus  25000.0 1.5%      5000.0
2  EMP03  pranjali      M  27000.0    2%  Getbonus    27000.0 2%      5400.0
3  EMP01    ayushi      F  20000.0    0%   nobonus    20000.0 0%      4000.0
4  EMP05     rohit      M  25000.0    0%   nobonus    25000.0 0%      5000.0
5  EMP06     rohit      M  30000.0    3%  Getbonus    30000.0 3%      6000.0
6  EMP02     rohit      M  25000.0    2%  Getbonus    25000.0 2%      5000.0

In [30]:
data = {"Month":["january", "February", "March", "April", "May"]}
a = pd.DataFrame(data) #creat dictionary
print(a)

      Month
0   january
1  February
2     March
3     April
4       May

In [ ]:
def extract (value):  # extract first three word from colum
    return value[0:3]

a["short month"] = a["Month"].map(extract)
print(a)

      Month short month
0   january         jan
1  February         Feb
2     March         Mar
3     April         Apr
4       May         May

In [34]:
a["short month"] = a["Month"].str[0:3] #shortcut method
print(a)

      Month short month
0   january         jan
1  February         Feb
2     March         Mar
3     April         Apr
4       May         May

Group By in Pandas

In [15]:
import pandas as pd  # pip install openpyxl use this to run excel file.
data = pd.read_excel("E:/Git Demo/Python/ESD.xlsx")
print(data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [ ]:
gp = data.groupby(["Department","Gender"]).agg({"EEID":"count"})
print(gp) #used to find groupby details in the table.

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [13]:
gp1 = data.groupby("Country").agg({"Age":"mean"})
print(gp1)

                     Age
Country
Brazil         43.654676
China          45.389908
United States  44.197512

In [ ]:
gp2 = data.groupby("Country").agg({"Annual Salary":"max"})
print(gp2) #find maximum salary

               Annual Salary
Country
Brazil                258426
China                 257194
United States         258498

In [3]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")

df.head(6)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
print(df.isnull().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [5]:
print(df.bfill(inplace = True))

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female  26.0      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True    C  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False    C  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True    E  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True    B  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False    C  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [6]:
print(df.isnull().sum())

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           1
embark_town    0
alive          0
alone          0
dtype: int64